In [ ]:
import pandas as pd
import numpy as np

Reshaping dataframe

Dealing with duplicates:

In [ ]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [1, 2, 3]])
df.columns = ["a", "b", "c"]
df

In [ ]:
# deleting duplicate rows
df.drop_duplicates()

In [ ]:
df = pd.DataFrame([[1, 2, 3], [4, 2, 6], [1, 8, 7]])
df.columns = ["a", "b", "c"]
df

In [ ]:
# removing duplicates in column "b"
df.drop_duplicates(subset=["b"])

<h2>Handling Missing Data</h2>

<b>Why data might be missing?</b>
<br>
- Systematic Cause
- Privacy Concerns
- Information Loss

<b>Different types of missing data</b>
<br>
- structurally missing data: <i>we expect this data to be missing for some logical reason</i>
<br>
<br>
- missing completely at random (MCAR): <i>the probability of any datapoint being MCAR is the same for all data points</i>
<br>
<br>
- missing at random (MAR): <i>the probability of any data point being MAR is the same within groups of the observed data</i>
<br>
<br>
- missing not at random (MNAR): <i>there is some reason why the data is missing</i>
<br>
<br>

<b>Types of deletion:</b>
- listwise
- pairwise

In [ ]:
# drop rows that have any missing data
# data.dropna(inplace=True)

In [ ]:
# drop rows having missing data only in specific columns

# data.dropna(subset=['Height','Education'], #only looks at these two columns
#             inplace=True, #removes the rows and keeps the data variable
#             how='any') #removes data with missing data in either field

<b>Single Imputation:</b>
<br>
- using data around the missing data to "fill in the blank"
- types of single imputation:

<b>LOCF:</b> last observation carried forward

In [1]:
#df.fillna(method="ffill")

<b>NOCB:</b> next observation carried backward

In [2]:
#df.fillna(method="bfill")

<b>BOCF:</b> baseline observation carried forward
<br>
<br>
<b>WOCF:</b> worst observation carried forward

In [3]:
#df.fillna(value=required_value)

<b>Multiple Imputation:</b>

In [7]:
missing_df = pd.DataFrame({"a": [2, 4, -3, np.nan], "b": [4, -8, np.nan, 6], "c": [1, 9, 4, 8], "d": [3, 6, np.nan, None]})
missing_df

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0  NaN  4  NaN
3  NaN  6.0  8  NaN

In [8]:
# drop rows that have any missing data 
missing_df.dropna()

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0

In [9]:
# fill missing data with given value
missing_df.fillna(value = 0.0)

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0  0.0  4  0.0
3  0.0  6.0  8  0.0

In [10]:
# check cells for missing data
missing_df.isnull()

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False   True  False   True
3   True  False  False   True

In [11]:
# check if cells are not null
missing_df.notnull()

       a      b     c      d
0   True   True  True   True
1   True   True  True   True
2   True  False  True  False
3  False   True  True  False

In [14]:
# drop rows that are all null
missing_df.dropna(how="all")

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0  NaN  4  NaN
3  NaN  6.0  8  NaN

In [16]:
# drop columns that have any missing data 
missing_df.dropna(axis=1)

   c
0  1
1  9
2  4
3  8

<h2>Filling in missing data</h2>

In [17]:
# fill missing data with given value
missing_df.fillna(value = 0.0)

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0  0.0  4  0.0
3  0.0  6.0  8  0.0

In [20]:
# fill missing data with given value for each column
missing_df.fillna(value = {"a": -1, "b": -2, "d": -4})

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0 -2.0  4 -4.0
3 -1.0  6.0  8 -4.0

In [21]:
# fill data using interpolation method
missing_df.fillna(method="ffill")

     a    b  c    d
0  2.0  4.0  1  3.0
1  4.0 -8.0  9  6.0
2 -3.0 -8.0  4  6.0
3 -3.0  6.0  8  6.0

<h2>Data Transformation</h2>

<b>Removing Duplicates</b>

In [25]:
duplicate_df = pd.DataFrame({"A": ["a", "c", "b", "c"], "B": ["c", "b", "d", "b"], "C": ["a", "d", "c", "d"], "D": ["d", "b", "a", "b"]})
duplicate_df

   A  B  C  D
0  a  c  a  d
1  c  b  d  b
2  b  d  c  a
3  c  b  d  b

In [26]:
# check for duplicate rows
duplicate_df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [27]:
# drop duplicate rows
duplicate_df.drop_duplicates()

   A  B  C  D
0  a  c  a  d
1  c  b  d  b
2  b  d  c  a

In [29]:
# check for duplicate values in specific column
duplicate_df.duplicated(subset="D")

0    False
1    False
2    False
3     True
dtype: bool

In [30]:
# drop duplicate rows
# keep the last occurance
duplicate_df.drop_duplicates(keep="last")

   A  B  C  D
0  a  c  a  d
2  b  d  c  a
3  c  b  d  b

<b>Transforming data using function or mapping</b>

In [31]:
name_weight_data = pd.DataFrame({"name": ["A", "B", "C", "D"], "weight": [21.6, 63.9, 53.4, 74.2]})
name_weight_data

  name  weight
0    A    21.6
1    B    63.9
2    C    53.4
3    D    74.2

In [32]:
# change name to lowercase
name_weight_data.name.str.lower()

0    a
1    b
2    c
3    d
Name: name, dtype: object

<b>Replacing values</b>

In [33]:
duplicate_df

   A  B  C  D
0  a  c  a  d
1  c  b  d  b
2  b  d  c  a
3  c  b  d  b

In [34]:
# replacing values
duplicate_df.replace(to_replace=["a", "c"], value="X")

   A  B  C  D
0  X  X  X  d
1  X  b  d  b
2  b  d  X  X
3  X  b  d  b

In [35]:
# replacing values using regex
duplicate_df.replace(to_replace="[a-c]", value="X", regex=True)

   A  B  C  D
0  X  X  X  d
1  X  X  d  X
2  X  d  X  X
3  X  X  d  X

<b>Random sampling</b>

In [37]:
# taking sample of data without replacement
duplicate_df.sample(n=2)

   A  B  C  D
1  c  b  d  b
3  c  b  d  b

In [39]:
# taking sample of data with replacement
duplicate_df.sample(n=5, replace=True)

   A  B  C  D
1  c  b  d  b
2  b  d  c  a
2  b  d  c  a
0  a  c  a  d
2  b  d  c  a

<h2>String Manipulation</h2>

In [ ]:
# general string manipulation methods